#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-PetsL5uWK7dbrrbh

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging.fifo]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=53253040-8add-41d5-bac8-6b320b33c605]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_instance.composer_internal: Refreshing state... [id=i-02cfe356a7283027d]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0654ebbbd69258c54]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-740566457]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-842948316]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-9bf7bea8-2d91-4bb1-b1e1-95c308a14496]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-bc17797b-b6b4-4c79-a53f-db08e1ff691f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.pozorbot_lambda_sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "pozorbot_lambda_sqs"  {
      ~ id      = "2603454207" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:933752197999:image-builder-pozorbot-staging.fifo"
                      - Sid      = "PozorbotSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:sqs:us-east-1:933752197999:image-builder-pozorbot-staging.fifo",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.pozorbot_lambda_sqs will be updated in-place
  ~ resource "aws_iam_policy" "pozorbot_lambda_sqs" {
        id     = "arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging"
        name   = "pozorbot_lambda_sqs_staging"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:933752197999:image-builder-pozorbot-staging.fifo"
                      - Sid      = "PozorbotSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.pozorbot_sqs must be replaced
-/+ resource "aws_lambda_event_source_mapping" "pozorbot_sqs" {
      - batch_size                         = 10 -> null
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:us-east-1:933752197999:image-builder-pozorbot-staging.fifo" -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:us-east-1:933752197999:function:pozorbot_staging" -> (known after apply)
      ~ id                                 = "53253040-8add-41d5-bac8-6b320b33c605" -> (known after apply)
      ~ last_modified                      = "2021-01-27T13:05:17Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      ~ uuid                               = "53253040-8add-41d5-bac8-6b320b33c605" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue.image_builder_pozorbot must be replaced
-/+ resource "aws_sqs_queue" "image_builder_pozorbot" {
      ~ arn                               = "arn:aws:sqs:us-east-1:933752197999:image-builder-pozorbot-staging.fifo" -> (known after apply)
      ~ content_based_deduplication       = true -> false
      ~ fifo_queue                        = true -> false # forces replacement
      ~ id                                = "https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging.fifo" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "image-builder-pozorbot-staging.fifo" -> "image-builder-pozorbot-staging" # forces replacement
      + policy                            = (known after apply)
        tags                              = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Pozorbot Message Queue - staging"
            "ServiceOwner" = "Image Builder"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*